## 分块读入文本文件

设置pandas显示设置

In [5]:
import pandas as pd
import numpy as np

In [2]:
pd.options.display.max_rows = 10

In [3]:
result = pd.read_csv('examples/ex6.csv')

In [4]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

可以指明nrows

In [5]:
pd.read_csv('examples/ex6.csv', nrows = 6)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q

指定chunksize作为每一块的行数

In [35]:
chunker = pd.read_csv('examples/ex6.csv', chunksize = 1000)

In [36]:
chunker

In [37]:
for piece in chunker:
    print(piece['key'].value_counts())

S    48
O    44
F    40
J    39
Q    39
     ..
8    13
9    11
2    11
5     9
0     9
Name: key, Length: 36, dtype: int64
O    48
L    44
X    40
I    39
R    38
     ..
1    16
3    16
2    14
6    14
7    12
Name: key, Length: 36, dtype: int64
A    40
O    40
E    39
X    39
M    38
     ..
4    14
8    14
2    14
5    14
1    11
Name: key, Length: 36, dtype: int64
X    43
J    41
V    38
D    38
Q    38
     ..
9    15
0    15
8    13
7    12
4    12
Name: key, Length: 36, dtype: int64
E    54
Q    42
L    40
H    39
K    38
     ..
6    17
8    16
7    13
9     8
1     8
Name: key, Length: 36, dtype: int64
Y    42
F    41
K    41
X    38
V    37
     ..
8    17
3    16
4    13
2    12
0     8
Name: key, Length: 36, dtype: int64
C    41
L    41
W    39
Z    39
X    38
     ..
2    17
1    16
5    15
3    11
6     8
Name: key, Length: 36, dtype: int64
J    42
M    40
X    39
D    39
E    39
     ..
0    14
5    13
3    13
1    12
9     5
Name: key, Length: 36, dtype: int64
O    42
U    41
S    40
A    39
V    37
     ..
3    15
0    14
8    12
6    12
5    11
Name: key, Length: 36, dtype: int64
K    42
M    41
U    39
Y    38
P    38
     ..
8    15
5    15
9    15
7    14
1    12
Name: key, Length: 36, dtype: int64

In [15]:
tot = pd.Series([])

In [22]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value = 0)

In [23]:
tot = tot.sort_values(ascending = False)

In [24]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### 将数据写入文本格式

In [38]:
data = pd.read_csv('examples/ex5.csv')

In [39]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [40]:
data.to_csv('examples/out.csv')

其他分隔符：

写入到sys.stdout时，控制台打印文本结果

In [6]:
import sys

In [52]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [53]:
data.to_csv(sys.stdout, sep = '*')

*something*a*b*c*d*message
0*one*1*2*3.0*4*
1*two*5*6**8*world
2*three*9*10*11.0*12*foo

缺失值默认以空字符出现，你也可以用其他表示

In [54]:
data.to_csv(sys.stdout,na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [55]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

可以不写入索引和头行

In [56]:
data.to_csv(sys.stdout, index = False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

也可以写入一部分内容

In [57]:
data.to_csv(sys.stdout, index = False, columns = ['a','b'])

a,b
1,2
5,6
9,10

Series也有to_csv方法

In [58]:
datas = pd.date_range('1/1/2000',periods=7)

In [59]:
datas

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [60]:
ts = pd.Series(np.arange(7),index = datas)

In [61]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

##  使用分割格式

In [7]:
import csv

In [63]:
f = open('examples/ex7.csv')
reader = csv.reader(f)

In [65]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [66]:
with open ('examples/ex7.csv')as fp:
    lines = list(csv.reader(fp))

In [67]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [68]:
header, values = lines[0],lines[1:]

In [69]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [72]:
data_dict = {k:v for k,v in zip(header,zip(*values))}

In [73]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [83]:
f = open('examples/ex7.csv')

In [84]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [85]:
reader = csv.reader(f, dialect = my_dialect)

In [86]:
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

## XML和HTML

In [8]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [9]:
len(tables)

1

In [10]:
failures = tables[0]

In [11]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [12]:
failures['Closing Date']

0      September 23, 2016
1         August 19, 2016
2             May 6, 2016
3          April 29, 2016
4          March 11, 2016
5         October 2, 2015
6         October 2, 2015
7           July 10, 2015
8             May 8, 2015
9       February 27, 2015
10      February 13, 2015
11       January 23, 2015
12       January 16, 2015
13      December 19, 2014
14       November 7, 2014
15       October 24, 2014
16       October 17, 2014
17          July 25, 2014
18          July 18, 2014
19          June 27, 2014
20          June 20, 2014
21          June 20, 2014
22           May 30, 2014
23           May 23, 2014
24           May 16, 2014
25         April 25, 2014
26      February 28, 2014
27      February 28, 2014
28       January 31, 2014
29       January 24, 2014
              ...
517           May 9, 2008
518         March 7, 2008
519      January 25, 2008
520       October 4, 2007
521    September 28, 2007
522      February 2, 2007
523         June 25, 2004
524        March 19, 2004
525        March 12, 2004
526     February 14, 2004
527     November 14, 2003
528           May 9, 2003
529      February 7, 2003
530     December 17, 2002
531      November 8, 2002
532    September 30, 2002
533         June 27, 2002
534         June 26, 2002
535        March 28, 2002
536         March 1, 2002
537      February 7, 2002
538      February 1, 2002
539      January 18, 2002
540      January 11, 2002
541     September 7, 2001
542         July 27, 2001
543           May 3, 2001
544      February 2, 2001
545     December 14, 2000
546      October 13, 2000
Name: Closing Date, Length: 547, dtype: object

In [13]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [14]:
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
5     2015-10-02
6     2015-10-02
7     2015-07-10
8     2015-05-08
9     2015-02-27
10    2015-02-13
11    2015-01-23
12    2015-01-16
13    2014-12-19
14    2014-11-07
15    2014-10-24
16    2014-10-17
17    2014-07-25
18    2014-07-18
19    2014-06-27
20    2014-06-20
21    2014-06-20
22    2014-05-30
23    2014-05-23
24    2014-05-16
25    2014-04-25
26    2014-02-28
27    2014-02-28
28    2014-01-31
29    2014-01-24
         ...
517   2008-05-09
518   2008-03-07
519   2008-01-25
520   2007-10-04
521   2007-09-28
522   2007-02-02
523   2004-06-25
524   2004-03-19
525   2004-03-12
526   2004-02-14
527   2003-11-14
528   2003-05-09
529   2003-02-07
530   2002-12-17
531   2002-11-08
532   2002-09-30
533   2002-06-27
534   2002-06-26
535   2002-03-28
536   2002-03-01
537   2002-02-07
538   2002-02-01
539   2002-01-18
540   2002-01-11
541   2001-09-07
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [15]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

使用lxml.objectify解析xml

In [16]:
from lxml import objectify

In [20]:
path = 'examples/Performance_MNR.xml'

In [21]:
parsed = objectify.parse(open(path))

In [22]:
root = parsed.getroot()

In [23]:
root

In [24]:
data = []

In [25]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGGE', 'DECIMAL_PLACES']

In [29]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [30]:
perf = pd.DataFrame(data)

In [31]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,DESIRED_CHANGE,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,U,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95